lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_hw_spi.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2017 "Eric Poulsen" <eric@zyxod.com>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <stdint.h>
#include <string.h>

#include "../../../../micropy_updates/common/mp_spi_common.h"
#include "py/runtime.h"
#include "py/stream.h"
#include "py/mphal.h"
#include "extmod/modmachine.h"
#include "mphalport.h"

#include "driver/spi_master.h"
#include "soc/gpio_sig_map.h"
#include "soc/spi_pins.h"
#include "hal/spi_ll.h"

// SPI mappings by device, naming used by IDF old/new
// upython   | ESP32     | ESP32S2   | ESP32S3 | ESP32C3
// ----------+-----------+-----------+---------+---------
// SPI(id=1) | HSPI/SPI2 | FSPI/SPI2 | SPI2    | SPI2
// SPI(id=2) | VSPI/SPI3 | HSPI/SPI3 | SPI3    | err

// Number of available hardware SPI peripherals.
#if SOC_SPI_PERIPH_NUM > 2
#define MICROPY_HW_SPI_MAX (2)
#else
#define MICROPY_HW_SPI_MAX (1)
#endif

// Default pins for SPI(id=1) aka IDF SPI2, can be overridden by a board
#ifndef MICROPY_HW_SPI1_SCK
// Use IO_MUX pins by default.
// If SPI lines are routed to other pins through GPIO matrix
// routing adds some delay and lower limit applies to SPI clk freq
#define MICROPY_HW_SPI1_SCK SPI2_IOMUX_PIN_NUM_CLK
#define MICROPY_HW_SPI1_MOSI SPI2_IOMUX_PIN_NUM_MOSI
#define MICROPY_HW_SPI1_MISO SPI2_IOMUX_PIN_NUM_MISO
#endif

#ifndef MICROPY_HW_SPI1_CS
#define MICROPY_HW_SPI1_CS SPI2_IOMUX_PIN_NUM_CS
#endif

// Default pins for SPI(id=2) aka IDF SPI3, can be overridden by a board
#ifndef MICROPY_HW_SPI2_SCK
#if CONFIG_IDF_TARGET_ESP32
// ESP32 has IO_MUX pins for VSPI/SPI3 lines, use them as defaults
#define MICROPY_HW_SPI2_SCK SPI3_IOMUX_PIN_NUM_CLK      // pin 18
#define MICROPY_HW_SPI2_MOSI SPI3_IOMUX_PIN_NUM_MOSI    // pin 23
#define MICROPY_HW_SPI2_MISO SPI3_IOMUX_PIN_NUM_MISO    // pin 19
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
// ESP32S2 and S3 uses GPIO matrix for SPI3 pins, no IO_MUX possible
// Set defaults to the pins used by SPI2 in Octal mode
#define MICROPY_HW_SPI2_SCK SPI2_IOMUX_PIN_NUM_CLK_OCT
#define MICROPY_HW_SPI2_MOSI SPI2_IOMUX_PIN_NUM_MOSI_OCT
#define MICROPY_HW_SPI2_MISO SPI2_IOMUX_PIN_NUM_MISO_OCT
#endif
#endif

#ifdef MICROPY_HW_SPI2_SCK
#ifndef MICROPY_HW_SPI2_CS
#if CONFIG_IDF_TARGET_ESP32
#define MICROPY_HW_SPI2_CS SPI3_IOMUX_PIN_NUM_CS
#elif CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3
#define MICROPY_HW_SPI2_CS SPI2_IOMUX_PIN_NUM_CS_OCT
#endif
#endif
#endif

#define SPI_UNUSED(x) ((void)x)

#define MP_HW_SPI_MAX_XFER_BYTES (4092)
#define MP_HW_SPI_MAX_XFER_BITS (MP_HW_SPI_MAX_XFER_BYTES * 8) // Has to be an even multiple of 8

typedef struct _machine_hw_spi_default_pins_t {
    int8_t sck;
    int8_t mosi;
    int8_t miso;
    int8_t cs;
} machine_hw_spi_default_pins_t;


/*
typedef enum _mp_spi_state_t {
    MP_SPI_STATE_STOPPED,
    MP_SPI_STATE_STARTED,
    MP_SPI_STATE_SENDING
} mp_spi_state_t;

typedef struct _machine_hw_spi_bus_obj_t {
    uint8_t host;
    mp_obj_t sck;
    mp_obj_t mosi;
    mp_obj_t miso;
    int16_t active_devices;
    mp_spi_state_t state;
    void *user_data;
} machine_hw_spi_bus_obj_t;


typedef struct _machine_hw_spi_obj_t {
    mp_obj_base_t base;
    uint32_t baudrate;
    uint8_t polarity;
    uint8_t phase;
    uint8_t bits;
    uint8_t firstbit;
    mp_obj_t cs;
    machine_hw_spi_bus_obj_t *spi_bus;
    void *user_data;
} machine_hw_spi_obj_t;

*/

// Static objects mapping to SPI2 (and SPI3 if available) hardware peripherals.
static machine_hw_spi_bus_obj_t *machine_hw_spi_bus_objs[MICROPY_HW_SPI_MAX];


void machine_hw_spi_bus_add_device(machine_hw_spi_device_obj_t *device)
{
    device->spi_bus->device_count++;
    device->spi_bus->devices = m_realloc(device->spi_bus->devices, device->spi_bus->device_count * sizeof(machine_hw_spi_device_obj_t *));
}


void machine_hw_spi_bus_remove_device(machine_hw_spi_device_obj_t *device)
{
    uint8_t i;
    /*Find the device in the list*/
    for(i = 0; i < device->spi_bus->device_count; i++) {
        if(device->spi_bus->devices[i] == device) break;
    }

    for( ;i < device->spi_bus->device_count - 1; i++) {
        device->spi_bus->devices[i] = device->spi_bus->devices[i + 1];
    }

    device->spi_bus->device_count--;
    device->spi_bus->devices = m_realloc(device->spi_bus->devices, device->spi_bus->device_count * sizeof(machine_hw_spi_device_obj_t *));

    if (device->spi_bus->device_count == 0) {
        device->spi_bus->deinit(device->spi_bus);
    }
}


static void machine_hw_spi_device_deinit_callback(machine_hw_spi_device_obj_t *self)
{
    if (!self->active) return;

    switch (spi_bus_remove_device((spi_device_handle_t)self->user_data)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("SPI device already freed"));
            return;
    }
    int cs = (int)mp_obj_get_int(self->cs);

    if (cs != -1) {
        esp_rom_gpio_pad_select_gpio(cs);
        esp_rom_gpio_connect_out_signal(cs, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(cs, GPIO_MODE_INPUT);
    }
}


static void machine_hw_spi_device_deinit_internal(machine_hw_spi_device_obj_t *self)
{
    if (!self->active) return;

    switch (spi_bus_remove_device((spi_device_handle_t)self->user_data)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_ValueError, MP_ERROR_TEXT("SPI device already freed"));
            return;
    }
    int cs = (int)mp_obj_get_int(self->cs);

    if (cs != -1) {
        esp_rom_gpio_pad_select_gpio(cs);
        esp_rom_gpio_connect_out_signal(cs, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(cs, GPIO_MODE_INPUT);
    }

    machine_hw_spi_bus_remove_device(self);
}


static void machine_hw_spi_device_deinit(mp_obj_base_t *self_in)
{
    machine_hw_spi_device_obj_t *self = (machine_hw_spi_device_obj_t *)self_in;
    machine_hw_spi_device_deinit_internal(self);
}


static mp_uint_t gcd(mp_uint_t x, mp_uint_t y)
{
    while (x != y) {
        if (x > y) {
            x -= y;
        } else {
            y -= x;
        }
    }
    return x;
}


static void machine_hw_spi_bus_deinit_internal(machine_hw_spi_bus_obj_t *self)
{
    if (self->state == MP_SPI_STATE_STOPPED) return;

    for (uint8_t i = 0; i < self->device_count; i++) {
        self->devices[i]->deinit(self->devices[i]);
        self->devices[i]->active = false;
    }

    self->device_count = 0;
    self->devices = m_realloc(self->devices, self->device_count * sizeof(machine_hw_spi_device_obj_t *));

    switch (spi_bus_free((spi_host_device_t)self->host)) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI bus already freed"));
            return;
    }

    int miso = (int)mp_obj_get_int(self->miso);
    int mosi = (int)mp_obj_get_int(self->mosi);
    int sck = (int)mp_obj_get_int(self->sck);

    if (miso != -1) {
        esp_rom_gpio_pad_select_gpio(miso);
        esp_rom_gpio_connect_out_signal(miso, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(miso, GPIO_MODE_INPUT);
    }
    if (mosi != -1) {
        esp_rom_gpio_pad_select_gpio(mosi);
        esp_rom_gpio_connect_out_signal(mosi, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(mosi, GPIO_MODE_INPUT);
    }
    if (sck != -1) {
        esp_rom_gpio_pad_select_gpio(sck);
        esp_rom_gpio_connect_out_signal(sck, SIG_GPIO_OUT_IDX, false, false);
        gpio_set_direction(sck, GPIO_MODE_INPUT);
    }

    self->state = MP_SPI_STATE_STOPPED;
}



static mp_obj_t machine_hw_spi_bus_deinit(mp_obj_t self_in)
{
    machine_hw_spi_bus_obj_t *self = MP_OBJ_TO_PTR(self_in);
    machine_hw_spi_bus_deinit_internal(self);
    return mp_const_none;
}

MP_DEFINE_CONST_FUN_OBJ_1(machine_hw_spi_bus_deinit_obj, machine_hw_spi_bus_deinit);


static void machine_hw_spi_device_transfer(mp_obj_base_t *self_in, size_t len, const uint8_t *src, uint8_t *dest)
{
    machine_hw_spi_device_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (!self->active) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI device is no longer attached to a bus"));
        return;
    }
    if (self->spi_bus->state == MP_SPI_STATE_STOPPED) {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("SPI bus is no longer active"));
        return;
    }

    spi_device_handle_t spi_device = (spi_device_handle_t)self->user_data;
    spi_device_acquire_bus(spi_device, portMAX_DELAY);

    // Round to nearest whole set of bits
    int bits_to_send = len * 8 / self->bits * self->bits;

    if (!bits_to_send) {
        mp_raise_ValueError(MP_ERROR_TEXT("buffer too short"));
    }

    if (len <= 4) {
        spi_transaction_t transaction = { 0 };

        if (src != NULL) {
            memcpy(&transaction.tx_data, src, len);
        }

        transaction.flags = SPI_TRANS_USE_TXDATA | SPI_TRANS_USE_RXDATA;
        transaction.length = bits_to_send;
        spi_device_transmit(spi_device, &transaction);

        if (dest != NULL) {
            memcpy(dest, &transaction.rx_data, len);
        }
    } else {
        int offset = 0;
        int bits_remaining = bits_to_send;
        int optimum_word_size = 8 * self->bits / gcd(8, self->bits);
        int max_transaction_bits = SPI_LL_DMA_MAX_BIT_LEN / optimum_word_size * optimum_word_size;
        spi_transaction_t *transaction, *result, transactions[2];
        int i = 0;


        while (bits_remaining) {
            transaction = transactions + i++ % 2;
            memset(transaction, 0, sizeof(spi_transaction_t));

            if (bits_remaining > max_transaction_bits) {
                transaction->length = max_transaction_bits;
                transaction->flags |= SPI_TRANS_CS_KEEP_ACTIVE;
            } else {
                transaction->length = bits_remaining;
            }

            if (src != NULL) {
                transaction->tx_buffer = src + offset;
                transaction->flags |= SPI_TRANS_USE_TXDATA;
            }
            if (dest != NULL) {
                transaction->rx_buffer = dest + offset;
                transaction->flags |= SPI_TRANS_USE_RXDATA;
            }

            spi_device_queue_trans(spi_device, transaction, portMAX_DELAY);
            bits_remaining -= transaction->length;

            if (offset > 0) {
                // wait for previously queued transaction
                MP_THREAD_GIL_EXIT();
                spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
                MP_THREAD_GIL_ENTER();
            }

            // doesn't need ceil(); loop ends when bits_remaining is 0
            offset += transaction->length / 8;
        }

        // wait for last transaction
        MP_THREAD_GIL_EXIT();
        spi_device_get_trans_result(spi_device, &result, portMAX_DELAY);
        MP_THREAD_GIL_ENTER();
    }

    spi_device_release_bus(spi_device);
}

/******************************************************************************/
// MicroPython bindings for hw_spi

mp_obj_t machine_hw_spi_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_host, ARG_mosi, ARG_miso, ARG_sck };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_host,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_mosi,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_miso,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_sck,      MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT }
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t host = (uint8_t)args[ARG_host].u_int;
    int mosi = (int)args[ARG_mosi].u_int;
    int miso = (int)args[ARG_miso].u_int;
    int sck = (int)args[ARG_sck].u_int;

    machine_hw_spi_bus_obj_t *self;

    if (1 <= host && host <= MICROPY_HW_SPI_MAX) {
        self = machine_hw_spi_bus_objs[host - 1];
    } else {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) doesn't exist"), host);
        return mp_const_none;
    }

    bool reconfigure = false;

    if (self == NULL) {
        reconfigure = true;
        self = m_new_obj(machine_hw_spi_bus_obj_t);
        self->base.type = &machine_hw_spi_bus_type;
        self->host = host;
        self->deinit = &machine_hw_spi_bus_deinit_internal;
        machine_hw_spi_bus_objs[host - 1] = self;
    } else {
        if ((int)mp_obj_get_int(self->mosi) != mosi) reconfigure = true;
        if ((int)mp_obj_get_int(self->miso) != miso) reconfigure = true;
        if ((int)mp_obj_get_int(self->sck) != sck) reconfigure = true;
    }

    if (reconfigure) {
        if (self->device_count > 0) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) has active devices, unable to change pins"), host);
            return mp_const_none;
        }

        self->miso = mp_obj_new_int((mp_int_t)miso);
        self->mosi = mp_obj_new_int((mp_int_t)mosi);
        self->sck = mp_obj_new_int((mp_int_t)sck);
    }

    return MP_OBJ_FROM_PTR(self);
}


void machine_hw_spi_bus_initilize(machine_hw_spi_bus_obj_t *bus)
{
    if (bus->state != MP_SPI_STATE_STOPPED) return;

    spi_bus_config_t buscfg = {
        .miso_io_num = (int)mp_obj_get_int(bus->miso),
        .mosi_io_num = (int)mp_obj_get_int(bus->mosi),
        .sclk_io_num = (int)mp_obj_get_int(bus->sck),
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
        .max_transfer_sz = SPI_LL_DMA_MAX_BIT_LEN / 8
    };

    esp_err_t ret;

#if CONFIG_IDF_TARGET_ESP32S2 || CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C3
    ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, SPI_DMA_CH_AUTO);
#else
    if (bus->host == SPI2_HOST) {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 1);
    } else {
        ret = spi_bus_initialize((spi_host_device_t)bus->host, &buscfg, 2);
    }
#endif

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) invalid configuration"), bus->host);
            return;

        case ESP_ERR_INVALID_STATE:
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("SPI(%d) sanity check"), bus->host);
            return;
    }

    bus->state = MP_SPI_STATE_STARTED;
}



spi_host_device_t machine_hw_spi_get_host(mp_obj_t in) {
    if (mp_obj_get_type(in) != &machine_hw_spi_bus_type) {
        mp_raise_ValueError(MP_ERROR_TEXT("expecting a SPI object"));
    }
    machine_hw_spi_bus_obj_t *self = (machine_hw_spi_bus_obj_t *)in;
    return (spi_host_device_t)self->host;
}


mp_obj_t machine_hw_spi_device_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

    enum { ARG_spi_bus, ARG_freq, ARG_cs, ARG_polarity, ARG_phase, ARG_bits, ARG_firstbit };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_spi_bus,  MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ },
        { MP_QSTR_freq,     MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_cs,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
        { MP_QSTR_polarity, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_phase,    MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 0} },
        { MP_QSTR_bits,     MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 8} },
        { MP_QSTR_firstbit, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = MICROPY_PY_MACHINE_SPI_MSB} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hw_spi_device_obj_t *self = m_new_obj(machine_hw_spi_device_obj_t);
    self->base.type = &machine_hw_spi_device_type;

    int cs =  (int)args[ARG_cs].u_int;

    self->spi_bus = MP_OBJ_TO_PTR(args[ARG_spi_bus].u_obj);
    self->cs = mp_obj_new_int((mp_int_t)cs);
    self->bits =  (uint8_t)args[ARG_bits].u_int;
    
    self->deinit = &machine_hw_spi_device_deinit_callback;

    spi_device_interface_config_t devcfg = {
        .clock_speed_hz = (uint32_t)spi_get_actual_clock(APB_CLK_FREQ, args[ARG_freq].u_int, 0),
        .mode = self->phase | (self->polarity << 1),
        .spics_io_num = cs,
        .queue_size = 2,
        .flags = self->firstbit == MICROPY_PY_MACHINE_SPI_LSB ? SPI_DEVICE_TXBIT_LSBFIRST | SPI_DEVICE_RXBIT_LSBFIRST : 0,
        .pre_cb = NULL
    };

    spi_device_handle_t spi_device = NULL;

    if (self->spi_bus->state == MP_SPI_STATE_STOPPED) {
        machine_hw_spi_bus_initilize(self->spi_bus);
    }

    esp_err_t ret = spi_bus_add_device((spi_host_device_t)self->spi_bus->host, &devcfg, &spi_device);
    self->user_data = spi_device;

    switch (ret) {
        case ESP_ERR_INVALID_ARG:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("invalid configuration"));
            return mp_const_none;

        case ESP_ERR_NO_MEM:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("out of memory"));
            return mp_const_none;

        case ESP_ERR_NOT_FOUND:
            mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("no free slots"));
            return mp_const_none;
    }

    machine_hw_spi_bus_add_device(self);
    self->active = true;

    return MP_OBJ_FROM_PTR(self);
}


static const mp_machine_spi_p_t machine_hw_spi_device_p = {
    .deinit = machine_hw_spi_device_deinit,
    .transfer = machine_hw_spi_device_transfer,
};


MP_DEFINE_CONST_OBJ_TYPE(
    machine_hw_spi_device_type,
    MP_QSTR_Device,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_device_make_new,
    protocol, &machine_hw_spi_device_p,
    locals_dict, &mp_machine_spi_locals_dict
);


static const mp_rom_map_elem_t machine_spi_bus_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR___del__),       MP_ROM_PTR(&machine_hw_spi_bus_deinit_obj)       }
};


MP_DEFINE_CONST_DICT(machine_spi_bus_locals_dict, machine_spi_bus_locals_dict_table);


MP_DEFINE_CONST_OBJ_TYPE(
    machine_hw_spi_bus_type,
    MP_QSTR_Bus,
    MP_TYPE_FLAG_NONE,
    make_new, machine_hw_spi_bus_make_new,
    locals_dict, &machine_spi_bus_locals_dict
);


static const mp_rom_map_elem_t machine_spi_locals_dict_table[] = {
    { MP_ROM_QSTR(MP_QSTR___name__),  MP_OBJ_NEW_QSTR(MP_QSTR_SPI)   },
    { MP_ROM_QSTR(MP_QSTR_Bus),       (mp_obj_t)&machine_hw_spi_bus_type },
    { MP_ROM_QSTR(MP_QSTR_Device),    (mp_obj_t)&machine_hw_spi_device_type }
};

MP_DEFINE_CONST_DICT(machine_spi_locals_dict, machine_spi_locals_dict_table);


MP_DEFINE_CONST_OBJ_TYPE(
    machine_spi_type,
    MP_QSTR_SPI,
    MP_TYPE_FLAG_NONE,
    locals_dict, &machine_spi_locals_dict
);